[frmMain]
mnuLanguage.Caption=語言（Language

pmnuExitTheSystem.Caption=退出系統

mnuSystemSettings.Caption=系統設置
mnuParameterSetting.Caption=參數設置
mnuBootUp.Caption=開機啟動
mnuExitTheSystem.Caption=退出系統

mnuReportTools.Caption=報表工具
mnuReportDesign.Caption=報表設計

mnuPrintLog.Caption=查看列印日誌


mnuJsonTools.Caption=json效驗工具（bejson.com）
mnuBase64.Caption=base64和圖片相互轉換
mnuUrlEncode.Caption=URL編碼/解碼
mnuSSLTools.Caption=SSL證書格式轉換工具
mnuOpenTheRootDirectory.Caption=打開根目錄
mnuOpenReportDirectory.Caption=打開報表目錄
mnuOpenLogDirectory.Caption=打開日誌目錄
mnuOpenTheOutputfileDirectory.Caption=打開輸出檔案目錄
mnuWindowDisplay.Caption=視窗顯示
mnuHttpPrint.Caption=HTTP列印
mnuMqttPrint.Caption=MQTT列印
mnuCamera.Caption=監視器
mnuIdCard.Caption=身份證
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=系統幫助
mnuAboutUs.Caption=關於我們

ts_http_print.Caption=HTTP列印
lblPort.Caption=埠
rb_print.Caption=列印
rb_Preview.Caption=預覽
ButtonStart.Caption=啟動
ButtonStop.Caption=停止

ts_mqtt_print.Caption=MQTT列印
gb_mqtt.Caption=MQTT服務器
lbl_mqtt_server_address.Caption=地址
lbl_mqtt_server_port.Caption=埠
lbl_mqtt_server_username.Caption=用戶名
lbl_mqtt_server_userpwd.Caption=密碼
lbl_mqtt_server_subscribe_topic.Caption=訂閱主題
lbl_mqtt_server_print_verification_code.Caption=列印驗證碼
ButtonStart_mqtt.Caption=啟動
ButtonStop_mqtt.Caption=停止

ts_camera.Caption=監視器
lbl_camera_device_list.Caption=設備清單
lbl_camera_resolution.Caption=分辯率
btn_open_camera.Caption=啟動監視器
btn_close_camera.Caption=關閉監視器
chk_auto_open_camera.Caption=自動啟動監視器
chk_pal_b.Caption=防止閃屏
chk_auto_top.Caption=表單置頂（總在最前面）


ts_idcard.Caption=身份證
lbl_idcard_name.Caption=姓名
lbl_idcard_sex.Caption=性別
lbl_idcard_nation.Caption=民族
lbl_idcard_birthday.Caption=出生日期
lbl_idcard_id.Caption=身份證號
lbl_idcard_org.Caption=簽發機關
lbl_idcard_addr.Caption=住址
lbl_idcard_begin.Caption=有效期起始
lbl_idcard_end.Caption=有效期結束
lbl_idcard_type.Caption=設備類型
btn_idcard_read.Caption=讀取
lbl_idcard_msg.Caption=消息提示：

[frmAbout]
btnOk.Caption=確定
Caption=關於

[LanguageString]
ini_NeedRegister=列印次數過多，請重啓列印挿件或者購買OEM版
ini_NoToken=token值不存在
ini_ReadIdCardError=消息提示：讀卡失敗！
ini_GetPrinterList=獲取打印機清單
ini_CreateDir=創建目錄
ini_FailPleaseCheck=失敗，請檢查
ini_PrintFailPleaseCheck=列印失敗，請檢查
ini_ReportFileNotExist=報表檔案不存在
ini_DownLoadError=下載出錯
ini_JsonFormatError=json格式有誤
ini_PrintingTimeoutPleaseCheck=列印超時，請檢查
ini_PictureFormatError=圖片格式不正確
ini_PdfFileNotExist=pdf檔案不存在
ini_PicFileNotExist=pic檔案不存在
ini_This=該
ini_NotSupport=不支持
ini_InterfaceCallFailed=介面調用失敗
ini_CameraNotActivated=監視器未啟動
ini_SelectFolder=選擇資料夾
ini_MinutesMustBeAnInteger=分鐘數必須為整數
ini_MinutesMustBeGreaterThanZero=分鐘數必須大於零
ini_SelfStartingClientNameCannotBeEmpty=自啟動用戶端名稱不能為空


ini_PdfFileCannotOpen=pdf檔案無法打開
ini_LicenseKeyInvalid=許可證金鑰無效


ini_PicFileCannotOpen=確認列印
ini_UnableInitializePrinter=不能初始化打印機
ini_PicPrint=pic列印
ini_PaperSize=紙張大小
ini_CustomMM=自定義(MM)
ini_Width=寬度
ini_Height=高度
ini_PrintingDirection=列印方向
ini_landscape=橫向
ini_portrait=豎向
ini_MarginMM=頁邊距(MM)
ini_Left=左
ini_Right=右
ini_Top=上
ini_Bottom=下
ini_Center=中
ini_VerticalPos=垂直位置
ini_HorizontalPos=水准位置
ini_Copys=份數
ini_DocumentTitle=文檔標題
ini_PrinterName=打印機名稱
ini_PageZoom=頁面縮放
ini_Normal=根據原始影像DPI確定列印尺寸（即創建真實尺寸的副本）
ini_FitToPage=拉伸影像以適合頁面，同時尊重其比例
ini_FitToPageStretch=拉伸影像以適合頁面，忽略比例
ini_FillPage=拉伸影像以填充整個頁面（根據其比例）
ini_SpecifiedSize=以絕對寬度和絕對高度參數指定的絕對大小列印
ini_MultiplePages=以絕對寬度和絕對高度參數指定的計數在多個頁面上列印影像（海報）
ini_SpecWidth=絕對寬度
ini_SpecHeight=絕對高度
ini_LoadPic=載入圖片
ini_ConfirmPrinting=確認列印



ini_PrintLog=列印日誌
ini_Date=日期
ini_Refresh=重繪
ini_OpenLogDirectory=打開日誌目錄
ini_OpenOutputFileDirectory=打開輸出檔案目錄
ini_ViewCustomFile=查看自定義檔案
ini_LogList=日誌清單
ini_LogContent=日誌內容
ini_PdfFile=pdf檔案
ini_Directory=目錄
ini_NotExist=不存在



ini_ReportDesign=報表設計
ini_DoubleClickToOpenTheReportFile=按兩下可以打開報表檔案
ini_NewlyAdded=添加
ini_Modify=修改
ini_Delete=删除
ini_Copy=複製
ini_ReportDoesNotExist=報表不存在
ini_To=轉為
ini_Error=出錯
ini_InTheListBelow_selectTheReportFileYouWantToModify=請在下方清單中，選擇要修改的報表檔案
ini_TestReport=測試報表
ini_AreYouSureYouWantToDelete=是否確認删除嗎
ini_DeleteConfirmation=删除確認
ini_YouHaveChosenNotToDelete=您選擇了不删除
ini_ReportNameEn=報表名稱（英文）
ini_ReportNameAlias=報表名稱（別名）
ini_VersionNumber=版本號
ini_FileNameSuffixMustBe=檔名尾碼必須為
ini_Currently=當前為
ini_TheFileNameAlreadyExists=該檔名已經存在
ini_ReportInfo=報表資訊



ini_NoJsonFile=缺少json檔案
ini_PrintErrorJsonError=列印失敗，json格式有誤
ini_MustBe=必須為
ini_Or=或者
ini_ReportName=報表名稱
ini_CannotBeEmpty=不能為空
ini_MustBeIntOrFloat=必須為小數或整數類型
ini_DeleteLocalReportFile=删除本地報表檔案
ini_DownLoadReportFileToLocal=下載遠程報表到本地
ini_DownLoadReportFileError=下載報表檔案出錯
ini_DownLoadComplete=下載完成
ini_EditLocalReportVersion=修改本地報表版本號
ini_CreateReportFile=創建報表檔案
ini_PrintCopys=列印份數
ini_MustBeInt=必須為整數類型
ini_MustBeGreaterThanOrEqualTo=必須大於等於零
ini_DetermineIfThePrinterExists=判斷打印機是否存在
ini_Printer=打印機
ini_NotExistPayAttentionToCaseAndSpace=不存在，請注意大小寫和空格
ini_SetRightOffset=設定右偏移
ini_MustBeFloat=必須為浮點類型
ini_SetBottomOffset=設定底部偏移
ini_MustBeOneOrZero=必須為1或者0
ini_SetComponent=設定部件框
ini_Component=部件框
ini_ControlToArrayError=Control轉為array出錯
ini_LoadPicError=加載圖片出錯
ini_FormatError=格式有誤
ini_Parameter=參數
ini_ParameterToArrayError=Parameter轉為array出錯
ini_Field=欄位
ini_FieldToArrayError=Field轉為array出錯
ini_AFieldToArrayError=AField轉為array出錯
ini_BFieldToArrayError=BField轉為array出錯
ini_CFieldToArrayError=CField轉為array出錯
ini_DFieldToArrayError=DField轉為array出錯
ini_EFieldToArrayError=EField轉為array出錯
ini_FFieldToArrayError=FField轉為array出錯
ini_GFieldToArrayError=GField轉為array出錯
ini_HFieldToArrayError=HField轉為array出錯
ini_IFieldToArrayError=IField轉為array出錯
ini_JFieldToArrayError=JField轉為array出錯
ini_DataRow=數據行
ini_DataToArrayError=Data轉為array出錯
ini_ADataToArrayError=AData轉為array出錯
ini_BDataToArrayError=BData轉為array出錯
ini_CDataToArrayError=CData轉為array出錯
ini_DDataToArrayError=DData轉為array出錯
ini_EDataToArrayError=EData轉為array出錯
ini_FDataToArrayError=FData轉為array出錯
ini_GDataToArrayError=GData轉為array出錯
ini_HDataToArrayError=HData轉為array出錯
ini_IDataToArrayError=IData轉為array出錯
ini_JDataToArrayError=JData轉為array出錯
ini_SetOffsetValue=設定偏移值
ini_SetPrinterName=設定打印機名稱
ini_ExportFileYes=是否匯出檔案 是
ini_ExportFileName=匯出檔案名稱
ini_ExportComplete=匯出完畢
ini_PreviewComplete=預覽完畢
ini_PrintComplete=列印完畢
ini_LoadReport=加載報表
ini_ADataToArraySuccess=AData轉為array成功
ini_BDataToArraySuccess=BData轉為array成功
ini_CDataToArraySuccess=CData轉為array成功
ini_DDataToArraySuccess=DData轉為array成功
ini_EDataToArraySuccess=EData轉為array成功
ini_FDataToArraySuccess=FData轉為array成功
ini_GDataToArraySuccess=GData轉為array成功
ini_HDataToArraySuccess=HData轉為array成功
ini_IDataToArraySuccess=IData轉為array成功
ini_JDataToArraySuccess=JData轉為array成功





ini_NoClientID=沒有clientid的值
ini_ClientIDEmpty=clientid不能為空
ini_PrinteridWrong=printerid不對
ini_PrinterpwdWrong=printerpwd不對
ini_MethodWrong=method不正確
ini_PingSuccessful=ping成功
ini_PingTimeout=ping超時
ini_ConnectionResults=連接結果
ini_subscribeResultMessageID=訂閱結果，消息ID
ini_UnsubscribeResultMessageID=取消訂閱結果，消息ID
ini_Received_release_confirmation_QoS_1_message_ID=收到發佈確認Qos 1，消息ID
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=收到發佈確認Qos 2第1步，消息ID
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=收到發佈確認Qos 2第3步，消息ID
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=收到發佈確認Qos 2第2步，消息ID
ini_ConnectionTimedOut=連接超時
ini_PublishingTimeout=發佈超時
ini_MessageID=消息ID
ini_Topic=主題
ini_Content=內容
ini_CameraOn=監視器已打開
ini_OpenFailed=打開失敗
ini_NoVideoDevicesWereFound=沒有找到視頻設備
ini_Stopped=已停止
ini_CameraStartFailed=監視器啟動失敗
ini_CameraOff=監視器已關閉
ini_Disconnect=斷開連接
ini_Started=已啟動
ini_Failed_to_start_Please_try_another_port=啟動失敗，請換個埠試試
ini_Minimum_desktop_requirements_Windows_Vista=案頭版最低要求：Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=服務器最低要求：Windows Server 2008





ini_Table_structure_field_type=錶結構欄位類型ftBlob（base64格式），ftString ftInteger ftBoolean，ftFloat，ftCurrency，ftDateTime，
ini_size_ftString_ftInteger_ftBlob=Size（ftString設定為實際長度，其他的設定為0，例如ftInteger ftBlob等設定為0）
ini_Currently_10_tables_are_supported=當前支持10個錶ABCDEFGHIJ例如錶A包含AField AData一直到錶J包含JField JData



ini_ParameterSetting=參數設置
ini_Log_save_path_if_empty_the_default_is_log_directory=日誌保存路徑（為空默認為log目錄）
ini_Clear_log_on_startup=啟動時清空日誌
ini_Clear_log_on_exit=退出時清空日誌
ini_In_operation_every=運行中，每隔XX分鐘，清空一次
ini_Save_settings=保存設置
ini_journal=日誌
ini_report_form=報表
ini_Report_template_path_empty_default_report_directory=報表範本路徑（為空默認report目錄）
ini_Export_file_path_empty_default_export_directory=匯出檔案路徑（為空默認export目錄）
ini_Export_file_format_blank_default_PDF_format=匯出檔案格式（為空默認pdf格式）
ini_Enable_token=啟用token
ini_Token_list_one_for_each_line_similar_to_white_list=token清單（一行一個，類似白名單）
ini_other=其他
ini_Minimize_after_startup=啟動後最小化
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=自定義用戶端名稱，讓其可以啟動多個用戶端





ini_URL_encoding_decoding=URL編碼/解碼
ini_URLEncode=UrlEncode編碼
ini_URLDecode=UrlDecode解碼




ini_Base64_and_image_conversion=base64和圖片相互轉換
ini_exceed_100k=為了平衡在生產環境中的效率，一般單個圖片檔案不要超過100K。
ini_Base64_string=base64字串
ini_paste=粘貼
ini_Turn_to_picture=轉為圖片
ini_picture=圖片



ini_Connection=連接
ini_write_log=生成日誌